sii/xml_examples/ejemplo_xml_alta_factura_emitida.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
                  xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <siiLR:SuministroLRFacturasEmitidas>
            <sii:Cabecera>
                <sii:IDVersionSii>0.6</sii:IDVersionSii>
                <sii:Titular>
                    <sii:NombreRazon>EMPRESAXXXX</sii:NombreRazon>
                    <sii:NIF>A84532501</sii:NIF>
                </sii:Titular>
                <sii:TipoComunicacion>A0</sii:TipoComunicacion>
            </sii:Cabecera>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoImpositivo>
                    <sii:Ejercicio>2015</sii:Ejercicio>
                    <sii:Periodo>01</sii:Periodo>
                </sii:PeriodoImpositivo>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>A84532501</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>01</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>15-01-2015</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F1</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>26.70</sii:ImporteTotal>
                    <sii:DescripcionOperacion>CompraXXXXXXX</sii:DescripcionOperacion>
                    <sii:Contraparte>
                        <sii:NombreRazon>EMPRESAYYYYYYYY</sii:NombreRazon>
                        <sii:NIF>94234500B</sii:NIF>
                    </sii:Contraparte>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                            <sii:BaseImponible>22.07</sii:BaseImponible>
                                            <sii:CuotaRepercutida>4.63</sii:CuotaRepercutida>
                                            <sii:TipoRecargoEquivalencia>0</sii:TipoRecargoEquivalencia>
                                            <sii:CuotaRecargoEquivalencia>0</sii:CuotaRecargoEquivalencia>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoImpositivo>
                    <sii:Ejercicio>2015</sii:Ejercicio>
                    <sii:Periodo>05</sii:Periodo>
                </sii:PeriodoImpositivo>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>A84532501</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>02</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>15-01-2015</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F2</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>08</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>50</sii:ImporteTotal>
                    <sii:DescripcionOperacion>CompraYYYYYYYYYYYYYYYYYYYYY</sii:DescripcionOperacion>
                    <sii:EmitidaPorTerceros>S</sii:EmitidaPorTerceros>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:Exenta>
                                    <sii:CausaExencion>E4</sii:CausaExencion>
                                    <sii:BaseImponible>50</sii:BaseImponible>
                                </sii:Exenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
        </siiLR:SuministroLRFacturasEmitidas>
    </soapenv:Body>
</soapenv:Envelope>